
&НаСервере
Процедура РассчитатьНаСервере()
	
	Объект.ТаблицаПремий.Очистить();
	
	ТаблицаОборотовПоСотрудникам = РегистрыНакопления.Продажи.Обороты(Объект.ДатаСКоторойСчитать, Объект.ДатаДоКоторойСчитать);
	
	Для Каждого СтрокаОборот Из ТаблицаОборотовПоСотрудникам Цикл
		
		Поиск = Новый Структура;
		Поиск.Вставить("Сотрудник", СтрокаОборот.Сотрудник);
		НайденныеСтроки = Объект.ТаблицаПремий.НайтиСтроки(Поиск);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НоваяСтрока = НайденныеСтроки[0];
			
		Иначе
			
			НоваяСтрока = Объект.ТаблицаПремий.Добавить();
			НоваяСтрока.Сотрудник = СтрокаОборот.Сотрудник;
			
		КонецЕсли; 
		
		Если СтрокаОборот.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			НоваяСтрока.ПродажиТоваров = НоваяСтрока.ПродажиТоваров + СтрокаОборот.Сумма;
			НоваяСтрока.ПремияЗаПродажуТоваров = НоваяСтрока.ПремияЗаПродажуТоваров + СтрокаОборот.Сумма * (Объект.ПроцентНаТовары * 0.01);
			
		Иначе
			
			НоваяСтрока.ПродажиУслуг = НоваяСтрока.ПродажиУслуг + СтрокаОборот.Сумма;
			НоваяСтрока.ПремияЗаПродажиУслуг = НоваяСтрока.ПремияЗаПродажиУслуг + СтрокаОборот.Сумма * (Объект.ПроцентНаУслуги * 0.01);
			
		КонецЕсли; 
		
		НоваяСтрока.Премия = НоваяСтрока.ПремияЗаПродажуТоваров + НоваяСтрока.ПремияЗаПродажиУслуг;
		
	КонецЦикла;
				
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры