
&НаКлиенте
Процедура ПутьКИсходномуФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбратьФайлАсинхронно();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для загрузки данных";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();

	Если РезультатВыбора = Неопределено Тогда

		Возврат;
		
	КонецЕсли;

	ПутьКИсходномуФайлу = РезультатВыбора[0];
                       
КонецПроцедуры

&НаКлиенте
Процедура КаталогСЧастямиФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ВыбратьКаталогАсинхронно();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьКаталогАсинхронно()

	РежимДиалогаВыбораКаталога = РежимДиалогаВыбораФайла.ВыборКаталога; 
    ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораКаталога); 
    ДиалогОткрытия.Заголовок = "Выберите каталог";	                      
	
	РезультатВыбора = Ждать ДиалогОткрытия.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		
		Возврат;
			
	КонецЕсли;
	
	КаталогСЧастямиФайла = РезультатВыбора[0];
	
КонецПроцедуры

&НаКлиенте                             
Асинх Процедура РазбитьФайлНаЧасти(Команда)  
	
	Если Не ЗначениеЗаполнено(ПутьКИсходномуФайлу) Тогда
		
		Сообщить("Исходный файл не выбран");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КаталогСЧастямиФайла) Тогда
		
		Сообщить("Каталог не выбран");
		Возврат;
		
	КонецЕсли;
	
	Поток = Новый ФайловыйПоток(ПутьКИсходномуФайлу, РежимОткрытияФайла.Открыть);
	Обещание = Поток.РазмерАсинх();
	
	ОсталосьПрочитать = Ждать Обещание;
	
	ВсегоЧастей = Цел(ОсталосьПрочитать / РазмерЧастиВБайтах) + 1;   
		
	Для Счетчик = 1 По ВсегоЧастей Цикл 
		
		ИмяЧасти = "Часть_" + Строка(Счетчик);                                  
		
		ПотокЧасти = Новый ФайловыйПоток(ИмяЧасти, РежимОткрытияФайла.Создать);
		
		Если ОсталосьПрочитать > РазмерЧастиВБайтах Тогда
			
			Поток.КопироватьВ(ПотокЧасти, РазмерЧастиВБайтах);     
			
			ОсталосьПрочитать = ОсталосьПрочитать - РазмерЧастиВБайтах;
			
		Иначе 
			
			Поток.КопироватьВ(ПотокЧасти, ОсталосьПрочитать);	
			
		КонецЕсли; 
		
		ПотокЧасти.ЗакрытьАсинх();
		
	КонецЦикла;  
	
	Поток.ЗакрытьАсинх();

КонецПроцедуры
     
&НаКлиенте
Процедура ЧастиФайлаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ВыбратьФайлДляСборкиАсинхронно();	
	
КонецПроцедуры                       

&НаКлиенте
Асинх Процедура ВыбратьФайлДляСборкиАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Заголовок = "Выберите файл для загрузки данных";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();

	Если РезультатВыбора = Неопределено Тогда

		Возврат;
		
	КонецЕсли;
	
    СтрокаЧасти = Элементы.ЧастиФайла.ТекущиеДанные;
	СтрокаЧасти.ПутьКЧасти = РезультатВыбора[0];
	
КонецПроцедуры  

&НаКлиенте
Процедура ПутьКРезультирующемуФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	 ВыбратьПутьКРезультирующемуФайлуАсинхронно();
	
 КонецПроцедуры
 
 &НаКлиенте
Асинх Процедура ВыбратьПутьКРезультирующемуФайлуАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для сохранения данных";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();

	Если РезультатВыбора = Неопределено Тогда

		Возврат;
		
	КонецЕсли;

	ПутьКРезультирующемуФайлу = РезультатВыбора[0];	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СобратьФайл(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКРезультирующемуФайлу) Тогда
		
		Сообщить("Результирующий файл не выбран");
		Возврат;
		
	КонецЕсли;
	
	Если ЧастиФайла.Количество() = 0 Тогда
		
		Сообщить("Части файла не заданы");
		Возврат;
		
	КонецЕсли; 
	
	ИтоговыйФайл = Новый Файл(ПутьКРезультирующемуФайлу);
	
	ПотокЗаписи = Новый ФайловыйПоток(ПутьКРезультирующемуФайлу.ПолноеИмя, РежимОткрытияФайла.СоздатьНовый, ДоступКФайлу.Запись);
	
	Для Каждого Строка Из ЧастиФайла Цикл
		
		ПотокЧтения = Новый ФайловыйПоток(Строка.ПолноеИмя, РежимОткрытияФайла.Открыть, ДоступКФайлу.Чтение);
		ПотокЧтения = Ждать ФайловыеПотоки.ОткрытьДляЧтенияАсинх(Строка.ПутьКЧасти);
		
		ЧтениеДанных = Новый ЧтениеДанных(ПотокЧтения);
		
		ЧтениеДанных.КопироватьВАсинх(ПотокЗаписи);
		
		ЧтениеДанных.ЗакрытьАсинх();
		
		ПотокЧтения.ЗакрытьАсинх();	
		
	КонецЦикла; 
	
	ПотокЗаписи.ЗакрытьАсинх();
	
КонецПроцедуры

