Функция ИННВерен(ИНН) Экспорт
	
	Если СтрДлина(ИНН) <> 10 Тогда 
		Возврат Ложь;
	КонецЕсли;    
	
	Если СтрДлина(ИНН) = 12 Тогда
		Возврат Истина
	КонецЕсли;
	
	МножительИНН = новый Массив(10);    
	МножительИНН[0] = 2;
	МножительИНН[1] = 4;
	МножительИНН[2] = 10;
	МножительИНН[3] = 3;
	МножительИНН[4] = 5;
	МножительИНН[5] = 9;
	МножительИНН[6] = 4;
	МножительИНН[7] = 6;
	МножительИНН[8] = 8;
	МножительИНН[9] = 0;
	
	КонтрольнаяСуммаИНН = 0;
	
	Для Счетчик = 1 По 10 Цикл
		КонтрольнаяСуммаИНН = КонтрольнаяСуммаИНН + Число(Сред(ИНН, Счетчик, 1)) * МножительИНН[Счетчик-1];
	КонецЦикла;                   
	
	КонтрольныйРазряд = КонтрольнаяСуммаИНН % 11;  
	
	Если КонтрольныйРазряд = Число(Сред(ИНН,10,1)) ИЛИ КонтрольныйРазряд = 10 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции