
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПутьКФайлуНачалоВыбораАсинхронно();
	
КонецПроцедуры     

&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбораАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда          
		
		Возврат;
		
	КонецЕсли;
	
	ПутьКФайлу = РезультатВыбора[0];     
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВBase64(Команда)
	
	ДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
	СтрокаBase64 = Base64Строка(ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзBase64(Команда)
	
	ЗначениеИзСтроки = Base64Значение(СтрокаBase64);
	ЗначениеИзСтроки.ЗаписатьАсинх(ПутьКФайлу);
	
КонецПроцедуры
