Процедура ЗагрузитьУпаковкиИзМакета(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент = Справочники.Упаковки.ПолучитьМакет("СтандартныеУпаковки");
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для Индекс = 1 По КоличествоСтрок Цикл 
		
		НовоеНаименование = ТабличныйДокумент.Область(Индекс, 1).Текст;
		
		УжеЗаписано = Справочники.Упаковки.НайтиПоНаименованию(НовоеНаименование);
		        
		Если ЗначениеЗаполнено(УжеЗаписано) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяУпаковка = Справочники.Упаковки.СоздатьЭлемент();
		НоваяУпаковка.Наименование = НовоеНаименование;  
		НоваяУпаковка.Записать();   
		                                          		
	КонецЦикла;   
КонецПроцедуры