Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;

	ТаблицаДляПроведения = Товары.Выгрузить();
	ТаблицаДляПроведения.Свернуть("Номенклатура", "Количество, Сумма");

	ТипТовар = Перечисления.ТипыНоменклатуры.Товар;  

	Для Каждого ТекСтрокаТовары Из ТаблицаДляПроведения Цикл
		       
		Если ТекСтрокаТовары.Номенклатура.ТипНоменклатуры = ТипТовар Тогда     
			
			ОтборПоТовару = Новый Структура;
			ОтборПОТовару.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
			Остатки = РегистрыНакопления.Товары.Остатки( Дата, ОтборПоТовару);
			
			Если Остатки.Количество() = 0 Тогда
				
				ТекстСообщения = СтрШаблон("%1 нет на складе!", ТекСтрокаТовары.Номенклатура);
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				Продолжить;
				
			КонецЕсли;
			
			СтрокаОстатка = Остатки[0];	
			Если СтрокаОстатка.Количество < ТекСтрокаТовары.Количество Тогда
				
				СколькоНеХватает = ТекСтрокаТовары.Количество - СтрокаОстатка.Количество;
				ТекстСообщения = СтрШаблон("Не хватает %1 единиц товара %2", СколькоНеХватает, ТекСтрокаТовары.Номенклатура);
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				Продолжить;
				
			КонецЕсли;      
			
			Если СтрокаОстатка.Количество = ТекСтрокаТовары.Количество Тогда    
				
				СуммаКСписанию = СтрокаОстатка.Сумма;
				
			Иначе      
				
				СебестоимостьЕдиницыТовара = СтрокаОстатка.Сумма / СтрокаОстатка.Количество;
				СуммаКСписанию = СебестоимостьЕдиницыТовара * ТекСтрокаТовары.Количество;
				
			КонецЕсли; 
			
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество; 
			Движение.Сумма = СуммаКСписанию;
			
		КонецЕсли;

		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Ответственный;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
	КонецЦикла;
	                	
КонецПроцедуры

