//Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
//    Сообщить("Установка параметров сеанса: " + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());
//КонецПроцедуры

Процедура УстановкаПараметровСеанса()
	
	ПолноеИмяТекущегоПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	НайденныйСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ПолноеИмяТекущегоПользователя);
	
	ПараметрыСеанса.СотрудникТекущегоПользователя = НайденныйСотрудник;
	
КонецПроцедуры    

