Процедура СформироватьПрайсЛист(ТабличныйДокумент, Ссылки) Экспорт
	
	Макет = ПолучитьМакет("ПрайсЛист");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	Шапка.Параметры.Дата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");  
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Заголовок"));
	
	ТабличныйДокумент.Вывести(Шапка);
	
	ТабличнаяЧастьЗаголовок = Макет.ПолучитьОбласть("ТабличнаяЧастьЗаголовок");
	ТабличныйДокумент.Вывести(ТабличнаяЧастьЗаголовок);
	
	ТабличнаяЧастьСтрока = Макет.ПолучитьОбласть("ТабличнаяЧастьСтрока");
	
	Для каждого СсылкаНоменклатура из Ссылки Цикл
		
		ТабличнаяЧастьСтрока.Параметры.Товар = СсылкаНоменклатура; 
		ТабличнаяЧастьСтрока.Параметры.Цена = ПолучитьЦенуНоменклатуры(СсылкаНоменклатура); 
		ТабличныйДокумент.Вывести(ТабличнаяЧастьСтрока);
		
	КонецЦикла;
	        
КонецПроцедуры

Функция ПолучитьЦенуНоменклатуры(СсылкаНоменклатура)
	
	Отбор = Новый Структура("Номенклатура", СсылкаНоменклатура);
	ПоследняяЗапись = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Возврат ПоследняяЗапись.Цена;
	
КонецФункции