
&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборВСпискеЭлементов", 0.2, Истина);

КонецПроцедуры

&НаКлиенте                     
Процедура УстановитьОтборВСпискеЭлементов()    
	
	РаботаСДинамическимСпискомКлиент.УстановитьОтборВСписке(Список, "Родитель", Элементы.СписокГрупп.ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)         
	
	ПодключитьОбработчикОжидания("УстановитьОтборЦен", 0.2, Истина);
	
КонецПроцедуры                                                      

&НаКлиенте
Процедура УстановитьОтборЦен() 

	РаботаСДинамическимСпискомКлиент.УстановитьОтборВСписке(СписокЦен, "Номенклатура", Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры


