
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Документ не согласован!");
	КонецЕсли;  
	
	Если ПроверкаНоменклатурыНаПовторение() Тогда
		Отказ = Истина;
		Сообщить("Есть повторяющиеся номенклатуры. Документ не будет проведен.");
	КонецЕсли;         
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныПоставщиков.Записывать = Истина;    
	
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Цена = ТекСтрокаЦены.Цена;
		Движение.Ответственный = Ответственный;
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ПроверкаНоменклатурыНаПовторение()  
	
	ВыгрузкаЦены = Цены.Выгрузить();
	
	КоличествоДоСвертки = ВыгрузкаЦены.Количество();
	ВыгрузкаЦены.Свернуть("Номенклатура");
	КоличествоПослеСвертки = ВыгрузкаЦены.Количество();
	ЕстьДубли = (КоличествоДоСвертки > КоличествоПослеСвертки);
	
	Возврат ЕстьДубли;
	
КонецФункции

