Процедура УстановитьОтборВСписке(Список, Поле, Значение) Экспорт

	ПолеСписка = Новый ПолеКомпоновкиДанных(Поле);
	
	ЭлементОтбора = Неопределено;
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеСписка Тогда
			ЭлементОтбора = Элемент;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементОтбора.ЛевоеЗначение = ПолеСписка;
	КонецЕсли;                                   
	
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Значение;	

КонецПроцедуры
