
&НаКлиенте
Процедура АдресФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбратьФайлФото();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлФото()

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите фотографию";
	ПараметрыДиалога.Фильтр = "Картинки|*.jpg; *.png";
	ПараметрыДиалога.МножественныйВыбор = Ложь;

	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх( , , , ПараметрыДиалога, УникальныйИдентификатор);

	Если ОписаниеФайла = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;

	АдресФото = ОписаниеФайла.Адрес;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(АдресФото) Тогда
		
		Если ТекущийОбъект.Фотография <> Неопределено Тогда
			
			ТекущийОбъект.Фотография = Новый ХранилищеЗначения(Неопределено)
			
		КонецЕсли;
		
	Иначе

		ДвоичныеДанныеФотографии = ПолучитьИзВременногоХранилища(АдресФото);

		ДанныеВХранилище = Новый ХранилищеЗначения(ДвоичныеДанныеФотографии);
		
		ТекущийОбъект.Фотография = ДанныеВХранилище;
			
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДвоичныеДанныеФотографии = ТекущийОбъект.Фотография.Получить();
	
	АдресФото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФотографии, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	АдресРезультата = ПодготовитьКартинку(АдресФото, УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(АдресРезультата) Тогда
		
		Сообщить("Фотография не выбрана");
		Возврат;
		
	КонецЕсли;
	
	 ПараметрыПолученияФайла = Новый ПараметрыДиалогаПолученияФайлов;
	 ПолучитьФайлССервераАсинх(АдресРезультата, Объект.Наименование + ".png", ПараметрыПолученияФайла);
	
 КонецПроцедуры
 
 &НаСервереБезКонтекста
 Функция ПодготовитьКартинку(АдресФото, УИДФормы)
	 
	 ДвоичныеДанныеФото = ПолучитьИзВременногоХранилища(АдресФото);
	 
	 Если ДвоичныеДанныеФото = Неопределено Тогда
		 
		 Сообщить("Фотография не заружена");
		 Возврат Неопределено;
		 
	 КонецЕсли;               
	 
	 Фото = Новый Картинка(ДвоичныеДанныеФото);
	 
	 Если Фото.Ширина() = 100 Тогда
		 
		Возврат АдресФото;	 
		 
	КонецЕсли;
	
	ОбрабатываемоеФото = Новый ОбрабатываемаяКартинка(Фото);
	ОбрабатываемоеФото.УстановитьРазмер(100, Неопределено);
	
	Фото = ОбрабатываемоеФото.ПолучитьКартинку();
	
	ДвоичныеДанныеФото = Фото.ПолучитьДвоичныеДанные();
	
	АдресИтоговогоФото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФото, УИДФормы);
	
	Возврат АдресИтоговогоФото;
	
	
	 
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
	
	ЭтотОбъект.АдресФото = "";	
	
КонецПроцедуры


