&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)     
	
	Слово = СокрЛП(Объект.Наименование);
	Пробел = Найти(Слово, " ");
	Если Пробел > 0 Тогда
		ИскомаяАббревиатура = Лев(Слово, Пробел-1);
	Иначе
		ИскомаяАббревиатура = Слово;
	КонецЕсли;
	
	ОПФАббревиатуры = Новый Структура;
	ОПФАббревиатуры.Вставить("ИП", "Индивидуальный предприниматель");
	ОПФАббревиатуры.Вставить("ООО", "Общество с ограниченной ответственностью");
	ОПФАббревиатуры.Вставить("АО", "Акционерное общество");
	ОПФАббревиатуры.Вставить("НКО", "Некоммерческая организация");
	
	ПолноеНаименование = СтрЗаменить(Объект.Наименование, ИскомаяАббревиатура, ОПФАббревиатуры[ИскомаяАббревиатура]);
	Объект.ПолноеНаименование = ПолноеНаименование;
КонецПроцедуры


&НаСервере
Процедура СписокКонтактныхЛицНаСервере(Контрагент)
	
	Если Контрагент.Наименование = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ВыборкаКонтактныхЛиц = Справочники.КонтактныеЛица.Выбрать( , Контрагент);
	Пока ВыборкаКонтактныхЛиц.Следующий()Цикл
		 ИмяКонтакта = ВыборкаКонтактныхЛиц.Наименование;
		 Должность = ВыборкаКонтактныхЛиц.Должность;
		 Телефон = ВыборкаКонтактныхЛиц.Телефон;
		 Сообщить(СтрШаблон("Имя контактного лица: %1 Должность: %2 Телефон: %3.", ИмяКонтакта, Должность, Телефон)); 
	КонецЦикла;		
	
КонецПроцедуры


&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	
	СписокКонтактныхЛицНаСервере(Объект.Ссылка);
	
КонецПроцедуры
 